app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'sixseven'
AND `is_deactivated` = 0
AND `is_verified` = 1
AND `role` IN ('admin','sadmin')
 LIMIT 1
---
    public function authenticate()
    {
        $usermodel = model('Users_model');

        $username = strtolower(trim($this->request->getPost('username')));
        $password = $this->request->getPost('password');

        $user = $usermodel->where('username', $username)
                          ->where('is_deactivated', 0)
                          ->where('is_verified', 1)
                          ->whereIn('role', ['admin', 'sadmin'])
                          ->first();