app/Controllers/Auth.php

    public function authenticate() {
        $adminmodel = model('Admin_model');

        $username = strtolower(trim($this->request->getPost('username')));
        $password = $this->request->getPost('password');

        $user = $adminmodel->where('username', $username)
                           ->where('is_deactivated', 0)
                           ->where('role', 'ITSO')
                           ->first();
---
SELECT *
FROM `admins`
WHERE `username` = 'sixseven'
AND `is_deactivated` = 0
AND `role` IN ('admin','sadmin')
 LIMIT 1