app/Controllers/Equipments.php

SELECT *
FROM `equipments`
WHERE `is_deactivated` = 0
---
    public function index()
    {
        if (!session()->get('admin')) {
            return redirect()->to(base_url('auth/login'));
        }

        $equipmentmodel = model('Equipments_Model');
        $perPage = 10;
        $equipments = $equipmentmodel
            ->where('is_deactivated', 0)
            ->paginate($perPage);
        $perPage = 10;


        $data = array(
            'title' => 'Equipment Dashboard',
            'admin' => session()->get('admin'),
            'pages' => $equipmentmodel->pager,
            'equipments' => $equipments
        );