app/Controllers/Index.php

    public function index() {
        if (!session()->get('admin')) {
            return redirect()->to(base_url('auth/login'));
        }
        // Use models for aggregated queries
        $equipmentModel = model('Equipments_Model');
        $borrowModel = model('Borrows_Model');

        // Total equipment: sum of `total_count` from `equipments`
        $row = $equipmentModel->select('SUM(total_count) AS total')->first();
        $total_equipment = (int) ($row['total'] ?? 0);

        // Available equipment: sum of `available_count` from `equipments`
        $row = $equipmentModel->select('SUM(available_count) AS available')->first();
---
SELECT SUM(total_count) AS total
FROM `equipments`
 LIMIT 1
SELECT SUM(available_count) AS available
FROM `equipments`
 LIMIT 1