app/Controllers/Index.php

    public function index() {
        if (!session()->get('user')) {
            return redirect()->to(base_url('auth/login'));
        }

        $adminmodel = model('Admin_model');
        $userId = session()->get('user')['id'];
        $user = $adminmodel->find($userId);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
SELECT *
FROM `users`
WHERE `users`.`id` = '2'