app/Controllers/Users.php

    public function index() {
        if (!session()->get('user')) {
            return redirect()->to(base_url('auth/login'));
        }

        $usermodel = new Users_Model();

        $data = [
            'title' => 'Users Dashboard',
            'user' => session()->get('user'),
            'users' => $usermodel->where('is_deactivated', 0)->findAll()
        ];
---
SELECT *
FROM `users`
WHERE `is_deactivated` = 0